In [9]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [10]:
nan=np.nan
s1=Series([2,nan,4,nan],index=['W','X','Y','Z'])
s1

W    2.0
X    NaN
Y    4.0
Z    NaN
dtype: float64

In [11]:
nan=np.nan
s2=Series([nan,3,nan,7],index=['W','X','Y','Z'])
s2

W    NaN
X    3.0
Y    NaN
Z    7.0
dtype: float64

In [12]:
Series(np.where(pd.isnull(s1),s2,s1),index=np.arange(len(s1)))

0    2.0
1    3.0
2    4.0
3    7.0
dtype: float64

In [13]:
s1.combine_first(s2)

W    2.0
X    3.0
Y    4.0
Z    7.0
dtype: float64

In [14]:
nan= np.nan
d1=DataFrame({'x':[nan,4,nan,6,nan,8],'y':[5,nan,8,nan,nan,7],
             'z':[20,7,nan,20,6,nan]})
d1

     x    y     z
0  NaN  5.0  20.0
1  4.0  NaN   7.0
2  NaN  8.0   NaN
3  6.0  NaN  20.0
4  NaN  NaN   6.0
5  8.0  7.0   NaN

In [15]:
nan=np.nan
d2=DataFrame({'x':[5,nan,8,8,nan,7,nan,8],'y':[9,10,nan,6,nan,nan,20,4]})
d2

     x     y
0  5.0   9.0
1  NaN  10.0
2  8.0   NaN
3  8.0   6.0
4  NaN   NaN
5  7.0   NaN
6  NaN  20.0
7  8.0   4.0

In [16]:
d1.combine_first(d2)

     x     y     z
0  5.0   5.0  20.0
1  4.0  10.0   7.0
2  8.0   8.0   NaN
3  6.0   6.0  20.0
4  NaN   NaN   6.0
5  8.0   7.0   NaN
6  NaN  20.0   NaN
7  8.0   4.0   NaN